app/controllers/festivals_controller.rb

  def edit
    @fest = Festival.find_by_id(params[:id])
---
SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = 1 LIMIT 1

  def update
    p = Festival.find_by_id(params[:id])
    p.name = params[:name]
    p.date = params[:date]
    p.city = params[:city]
    p.state = params[:state]
    p.save
---
SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = 2 LIMIT 1
UPDATE "festivals" SET "date" = '2012-04-01 00:00:00.000000', "updated_at" = '2012-10-25 19:12:44.347699' WHERE "festivals"."id" = 3

  def index
    @festivals = Festival.all
---
SELECT "festivals".* FROM "festivals"

  def show
    @fest = Festival.find_by_id(params[:id])
---
SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = 1 LIMIT 1

  def create
    p = Festival.new
    p.name = params[:name]
    p.date = params[:date]
    p.city = params[:city]
    p.state = params[:state]
    p.save
---
INSERT INTO "festivals" ("city", "created_at", "date", "name", "state", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def delete
    p = Festival.find_by_id(params[:id])
    p.destroy
---
SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = 5 LIMIT 1
DELETE FROM "festivals" WHERE "festivals"."id" = ?  [["id", 5]]